# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [6]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [7]:
df = pd.read_csv('data/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df_tsv = pd.read_csv('data/Restaurant_Reviews.tsv', sep='\t')
df_tsv

                                                Review  Liked
0                             Wow... Loved this place.      1
1                                   Crust is not good.      0
2            Not tasty and the texture was just nasty.      0
3    Stopped by during the late May bank holiday of...      1
4    The selection on the menu was great and so wer...      1
..                                                 ...    ...
995  I think food should have flavor and texture an...      0
996                           Appetite instantly gone.      0
997  Overall I was not impressed and would not go b...      0
998  The whole experience was underwhelming, and I ...      0
999  Then, as if I hadn't wasted enough of my life ...      0

[1000 rows x 2 columns]

In [9]:
df_tsv = pd.read_csv('data/spam_dataset.csv', sep='\t', names=['Status', 'Messages'])
df_tsv

     Status                                           Messages
0       ham  Go until jurong point, crazy.. Available only ...
1       ham                      Ok lar... Joking wif u oni...
2      spam  Free entry in 2 a wkly comp to win FA Cup fina...
3       ham  U dun say so early hor... U c already then say...
4       ham  Nah I don't think he goes to usf, he lives aro...
...     ...                                                ...
5567   spam  This is the 2nd time we have tried 2 contact u...
5568    ham               Will ü b going to esplanade fr home?
5569    ham  Pity, * was in mood for that. So...any other s...
5570    ham  The guy did some bitching but I acted like i'd...
5571    ham                         Rofl. Its true to its name

[5572 rows x 2 columns]

### CSV Output

In [10]:
df['new'] = df['a'] + df['d']
df

    a   b   c   d  new
0   0   1   2   3    3
1   4   5   6   7   11
2   8   9  10  11   19
3  12  13  14  15   27

In [11]:
df.to_csv('data/example1.csv')

In [12]:
df.to_csv('data/example2.csv', index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [13]:
df = pd.read_excel('data/Excel_Sample.xlsx', sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df['new'] = df['a'] + df['d']

In [15]:
df

   Unnamed: 0   a   b   c   d  new
0           0   0   1   2   3    3
1           1   4   5   6   7   11
2           2   8   9  10  11   19
3           3  12  13  14  15   27

In [16]:
df.drop('Unnamed: 0', axis=1, inplace=True)

In [17]:
df

    a   b   c   d  new
0   0   1   2   3    3
1   4   5   6   7   11
2   8   9  10  11   19
3  12  13  14  15   27

### Excel Output

In [18]:
df.to_excel('data/Excel_Sample1.xlsx',sheet_name='Sheet1')

In [19]:
df.to_excel('data/Excel_Sample2.xlsx',sheet_name='Sheet1', index=False)

# SQL

In [20]:
import mysql.connector

In [21]:
db = mysql.connector.connect(host="127.0.0.1",
                            user="root",
                            passwd="1514",
                            database="w3schools")
cursor = db.cursor()

In [25]:
%pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2
Note: you may need to restart the kernel to use updated packages.

In [30]:
from sqlalchemy import create_engine
import pymysql


sqlEngine = create_engine('mysql+pymysql://root:1514@127.0.0.1/w3schools', pool_recycle=3600)
dbConnection = sqlEngine.connect()

In [31]:
data = pd.read_sql('SELECT * FROM customers', dbConnection)
# data = pd.read_sql('SELECT * FROM data WHERE City=?', conn, params=['Ericson'])

In [32]:
data.head()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,05021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,05023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden

In [33]:
data.to_sql('customers22', con=dbConnection)

91

# Great Job!